lvx/base/Documents/АктСписанияЕГАИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>АктСписанияЕГАИС</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияСерийТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДокументовЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияЕГАИС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторОрганизацийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЕГАИС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаСписания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныСписанийЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатусОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОбработкиАктаСписанияЕГАИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрацииДвижений</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеАктаСписанияЕГАИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользователиИС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеПроверкиИПодбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПроверкиИПодбора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПроверкиИПодбораИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлкогольнаяПродукция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СерияНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Упаковка</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.КоличествоЕГАИСНеотрицательное</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаГосИСНеотрицательная</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>АкцизныеМарки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодАкцизнойМарки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>68</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АкцизнаяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихкодУпаковки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыУпаковокТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеКоличество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеВариантУчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУчетаЧастичногоВыбытияИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеНоменклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастичноеВыбытиеХарактеристика</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатуры</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбытиеБутылки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/CommonModules/АкцизныеМаркиЕГАИСУТ/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункцииУТ

// Возвращает запрос, проверяющий уникальность акцизной марки для операций "Продажа" и "Возврат".
//
// Возвращаемое значение:
//  Запрос - Запрос для проверки уникальности
Функция ЗапросПроверкиУникальностиПродажаВозврат(КодАкцизнойМарки, Операция) Экспорт
	
	НевыгруженныеСтатусыАктаСписания = Новый Массив;
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Черновик);
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПередачи);
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПроведенияЕГАИС);
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Отменен);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАкцизнойМарки",                 КодАкцизнойМарки);
	Запрос.УстановитьПараметр("Возврат",                          Операция = "Возврат");
	Запрос.УстановитьПараметр("НевыгруженныеСтатусыАктаСписания", НевыгруженныеСтатусыАктаСписания);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМТовары.Ссылка       КАК Ссылка,
	|	ЧекККМТовары.Ссылка.Дата  КАК Дата,
	|	ЧекККМТовары.Ссылка.Номер КАК Номер,
	|	ВЫБОР
	|		КОГДА &Возврат
	|			ТОГДА -ЧекККМТовары.Количество
	|		ИНАЧЕ ЧекККМТовары.Количество
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ПО ЧекККМАкцизныеМарки.Ссылка = ЧекККМТовары.Ссылка
	|			И ЧекККМАкцизныеМарки.ИдентификаторСтроки = ЧекККМТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекККМАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекККМАкцизныеМарки.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратТовары.Ссылка,
	|	ЧекККМВозвратТовары.Ссылка.Дата,
	|	ЧекККМВозвратТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА &Возврат
	|			ТОГДА ЧекККМВозвратТовары.Количество
	|		ИНАЧЕ -ЧекККМВозвратТовары.Количество
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЧекККМВозврат.АкцизныеМарки КАК ЧекККМВозвратАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Товары КАК ЧекККМВозвратТовары
	|		ПО ЧекККМВозвратАкцизныеМарки.Ссылка = ЧекККМВозвратТовары.Ссылка
	|			И ЧекККМВозвратАкцизныеМарки.ИдентификаторСтроки = ЧекККМВозвратТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекККМВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекККМВозвратАкцизныеМарки.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ЧекККМВозвратТовары.КоличествоУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекЕГАИСТовары.Ссылка,
	|	ЧекЕГАИСТовары.Ссылка.Дата,
	|	ЧекЕГАИСТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА &Возврат
	|			ТОГДА -ЧекЕГАИСТовары.Количество
	|		ИНАЧЕ ЧекЕГАИСТовары.Количество
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЧекЕГАИС.АкцизныеМарки КАК ЧекЕГАИСАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекЕГАИС.Товары КАК ЧекЕГАИСТовары
	|		ПО ЧекЕГАИСАкцизныеМарки.Ссылка = ЧекЕГАИСТовары.Ссылка
	|			И ЧекЕГАИСАкцизныеМарки.ИдентификаторСтроки = ЧекЕГАИСТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекЕГАИСТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекЕГАИСВозвратТовары.Ссылка,
	|	ЧекЕГАИСВозвратТовары.Ссылка.Дата,
	|	ЧекЕГАИСВозвратТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА &Возврат
	|			ТОГДА ЧекЕГАИСВозвратТовары.Количество
	|		ИНАЧЕ -ЧекЕГАИСВозвратТовары.Количество
	|	КОНЕЦ
	|ИЗ
	|	Документ.ЧекЕГАИСВозврат.АкцизныеМарки КАК ЧекЕГАИСВозвратАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекЕГАИСВозврат.Товары КАК ЧекЕГАИСВозвратТовары
	|		ПО ЧекЕГАИСВозвратАкцизныеМарки.Ссылка = ЧекЕГАИСВозвратТовары.Ссылка
	|			И ЧекЕГАИСВозвратАкцизныеМарки.ИдентификаторСтроки = ЧекЕГАИСВозвратТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекЕГАИСВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекЕГАИСВозвратТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСписанияЕГАИСТовары.Ссылка,
	|	АктСписанияЕГАИСТовары.Ссылка.Дата,
	|	АктСписанияЕГАИСТовары.Ссылка.Номер,
	|	ВЫБОР
	|		КОГДА &Возврат
	|			ТОГДА АктСписанияЕГАИСТовары.Количество
	|		ИНАЧЕ -АктСписанияЕГАИСТовары.Количество
	|	КОНЕЦ
	|ИЗ
	|	Документ.АктСписанияЕГАИС.Товары КАК АктСписанияЕГАИСТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСписанияЕГАИС.АкцизныеМарки КАК АктСписанияЕГАИСАкцизныеМарки
	|		ПО АктСписанияЕГАИСТовары.Ссылка = АктСписанияЕГАИСАкцизныеМарки.Ссылка
	|			И АктСписанияЕГАИСТовары.ИдентификаторСтроки = АктСписанияЕГАИСАкцизныеМарки.ИдентификаторСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО АктСписанияЕГАИСТовары.Ссылка = СтатусыДокументовЕГАИС.Документ
	|ГДЕ
	|	АктСписанияЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И АктСписанияЕГАИСТовары.Ссылка.Проведен
	|	И НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусыАктаСписания)
	|	И АктСписанияЕГАИСТовары.Ссылка.ПричинаСписания = ЗНАЧЕНИЕ(Перечисление.ПричиныСписанийЕГАИС.Реализация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Запрос;
	
КонецФункции

// Возвращает запрос, проверяющий уникальность акцизной марки для операции "АктПостановкиНаБаланс".
//
// Возвращаемое значение:
//  Запрос - Запрос для проверки уникальности
Функция ЗапросПроверкиУникальностиАктПостановкиНаБаланс(КодАкцизнойМарки) Экспорт
	
	НевыгруженныеСтатусы = Новый Массив;
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.Черновик);
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ОшибкаПередачи);
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ОшибкаПроведенияЕГАИС);
	НевыгруженныеСтатусы.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.Отменен);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАкцизнойМарки", КодАкцизнойМарки);
	Запрос.УстановитьПараметр("НевыгруженныеСтатусы", НевыгруженныеСтатусы);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМТовары.Ссылка       КАК Ссылка,
	|	ЧекККМТовары.Ссылка.Дата  КАК Дата,
	|	ЧекККМТовары.Ссылка.Номер КАК Номер,
	|	ЧекККМТовары.Количество   КАК Количество
	|ИЗ
	|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ПО ЧекККМАкцизныеМарки.Ссылка = ЧекККМТовары.Ссылка
	|			И ЧекККМАкцизныеМарки.ИдентификаторСтроки = ЧекККМТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекККМАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекККМАкцизныеМарки.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратТовары.Ссылка,
	|	ЧекККМВозвратТовары.Ссылка.Дата,
	|	ЧекККМВозвратТовары.Ссылка.Номер,
	|	ЧекККМВозвратТовары.Количество
	|ИЗ
	|	Документ.ЧекККМВозврат.АкцизныеМарки КАК ЧекККМВозвратАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Товары КАК ЧекККМВозвратТовары
	|		ПО ЧекККМВозвратАкцизныеМарки.Ссылка = ЧекККМВозвратТовары.Ссылка
	|			И ЧекККМВозвратАкцизныеМарки.ИдентификаторСтроки = ЧекККМВозвратТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекККМВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекККМВозвратАкцизныеМарки.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ЧекККМВозвратТовары.КоличествоУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекЕГАИСТовары.Ссылка,
	|	ЧекЕГАИСТовары.Ссылка.Дата,
	|	ЧекЕГАИСТовары.Ссылка.Номер,
	|	ЧекЕГАИСТовары.Количество
	|ИЗ
	|	Документ.ЧекЕГАИС.АкцизныеМарки КАК ЧекЕГАИСАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекЕГАИС.Товары КАК ЧекЕГАИСТовары
	|		ПО ЧекЕГАИСАкцизныеМарки.Ссылка = ЧекЕГАИСТовары.Ссылка
	|			И ЧекЕГАИСАкцизныеМарки.ИдентификаторСтроки = ЧекЕГАИСТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекЕГАИСТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекЕГАИСВозвратТовары.Ссылка,
	|	ЧекЕГАИСВозвратТовары.Ссылка.Дата,
	|	ЧекЕГАИСВозвратТовары.Ссылка.Номер,
	|	ЧекЕГАИСВозвратТовары.Количество
	|ИЗ
	|	Документ.ЧекЕГАИСВозврат.АкцизныеМарки КАК ЧекЕГАИСВозвратАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекЕГАИСВозврат.Товары КАК ЧекЕГАИСВозвратТовары
	|		ПО ЧекЕГАИСВозвратАкцизныеМарки.Ссылка = ЧекЕГАИСВозвратТовары.Ссылка
	|			И ЧекЕГАИСВозвратАкцизныеМарки.ИдентификаторСтроки = ЧекЕГАИСВозвратТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекЕГАИСВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекЕГАИСВозвратТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктПостановкиНаБалансЕГАИСТовары.Ссылка,
	|	АктПостановкиНаБалансЕГАИСТовары.Ссылка.Дата,
	|	АктПостановкиНаБалансЕГАИСТовары.Ссылка.Номер,
	|	АктПостановкиНаБалансЕГАИСТовары.Количество
	|ИЗ
	|	Документ.АктПостановкиНаБалансЕГАИС.Товары КАК АктПостановкиНаБалансЕГАИСТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПостановкиНаБалансЕГАИС.АкцизныеМарки КАК АктПостановкиНаБалансЕГАИСАкцизныеМарки
	|		ПО АктПостановкиНаБалансЕГАИСТовары.Ссылка = АктПостановкиНаБалансЕГАИСАкцизныеМарки.Ссылка
	|			И АктПостановкиНаБалансЕГАИСТовары.ИдентификаторСтроки = АктПостановкиНаБалансЕГАИСАкцизныеМарки.ИдентификаторСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО АктПостановкиНаБалансЕГАИСТовары.Ссылка = СтатусыДокументовЕГАИС.Документ
	|ГДЕ
	|	АктПостановкиНаБалансЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И АктПостановкиНаБалансЕГАИСТовары.Ссылка.Проведен
	|	И НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Запрос;
	
КонецФункции

// Возвращает запрос, проверяющий уникальность акцизной марки для операции "АктСписания".
// 
// Возвращаемое значение:
//  Запрос - Запрос для проверки уникальности
Функция ЗапросПроверкиУникальностиАктСписания(КодАкцизнойМарки) Экспорт
	
	НевыгруженныеСтатусыАктаСписания = Новый Массив;
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Черновик);
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПередачи);
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.ОшибкаПроведенияЕГАИС);
	НевыгруженныеСтатусыАктаСписания.Добавить(Перечисления.СтатусыОбработкиАктаСписанияЕГАИС.Отменен);
	
	НевыгруженныеСтатусыАктаПостановкиНаБаланс = Новый Массив;
	НевыгруженныеСтатусыАктаПостановкиНаБаланс.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.Черновик);
	НевыгруженныеСтатусыАктаПостановкиНаБаланс.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ОшибкаПередачи);
	НевыгруженныеСтатусыАктаПостановкиНаБаланс.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ОшибкаПроведенияЕГАИС);
	НевыгруженныеСтатусыАктаПостановкиНаБаланс.Добавить(Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.Отменен);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодАкцизнойМарки",                           КодАкцизнойМарки);
	Запрос.УстановитьПараметр("НевыгруженныеСтатусыАктаСписания",           НевыгруженныеСтатусыАктаСписания);
	Запрос.УстановитьПараметр("НевыгруженныеСтатусыАктаПостановкиНаБаланс", НевыгруженныеСтатусыАктаПостановкиНаБаланс);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЧекККМТовары.Ссылка       КАК Ссылка,
	|	ЧекККМТовары.Ссылка.Дата  КАК Дата,
	|	ЧекККМТовары.Ссылка.Номер КАК Номер,
	|	ЧекККМТовары.Количество   КАК Количество
	|ИЗ
	|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Товары КАК ЧекККМТовары
	|		ПО ЧекККМАкцизныеМарки.Ссылка = ЧекККМТовары.Ссылка
	|			И ЧекККМАкцизныеМарки.ИдентификаторСтроки = ЧекККМТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекККМАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекККМАкцизныеМарки.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекККМВозвратТовары.Ссылка,
	|	ЧекККМВозвратТовары.Ссылка.Дата,
	|	ЧекККМВозвратТовары.Ссылка.Номер,
	|	-ЧекККМВозвратТовары.Количество
	|ИЗ
	|	Документ.ЧекККМВозврат.АкцизныеМарки КАК ЧекККМВозвратАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМВозврат.Товары КАК ЧекККМВозвратТовары
	|		ПО ЧекККМВозвратАкцизныеМарки.Ссылка = ЧекККМВозвратТовары.Ссылка
	|			И ЧекККМВозвратАкцизныеМарки.ИдентификаторСтроки = ЧекККМВозвратТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекККМВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекККМВозвратАкцизныеМарки.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|	И ЧекККМВозвратТовары.КоличествоУпаковок <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекЕГАИСТовары.Ссылка,
	|	ЧекЕГАИСТовары.Ссылка.Дата,
	|	ЧекЕГАИСТовары.Ссылка.Номер,
	|	ЧекЕГАИСТовары.Количество
	|ИЗ
	|	Документ.ЧекЕГАИС.АкцизныеМарки КАК ЧекЕГАИСАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекЕГАИС.Товары КАК ЧекЕГАИСТовары
	|		ПО ЧекЕГАИСАкцизныеМарки.Ссылка = ЧекЕГАИСТовары.Ссылка
	|			И ЧекЕГАИСАкцизныеМарки.ИдентификаторСтроки = ЧекЕГАИСТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекЕГАИСТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЧекЕГАИСВозвратТовары.Ссылка,
	|	ЧекЕГАИСВозвратТовары.Ссылка.Дата,
	|	ЧекЕГАИСВозвратТовары.Ссылка.Номер,
	|	-ЧекЕГАИСВозвратТовары.Количество
	|ИЗ
	|	Документ.ЧекЕГАИСВозврат.АкцизныеМарки КАК ЧекЕГАИСВозвратАкцизныеМарки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекЕГАИСВозврат.Товары КАК ЧекЕГАИСВозвратТовары
	|		ПО ЧекЕГАИСВозвратАкцизныеМарки.Ссылка = ЧекЕГАИСВозвратТовары.Ссылка
	|			И ЧекЕГАИСВозвратАкцизныеМарки.ИдентификаторСтроки = ЧекЕГАИСВозвратТовары.ИдентификаторСтроки
	|ГДЕ
	|	ЧекЕГАИСВозвратАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И ЧекЕГАИСВозвратТовары.Ссылка.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктСписанияЕГАИСТовары.Ссылка,
	|	АктСписанияЕГАИСТовары.Ссылка.Дата,
	|	АктСписанияЕГАИСТовары.Ссылка.Номер,
	|	АктСписанияЕГАИСТовары.Количество
	|ИЗ
	|	Документ.АктСписанияЕГАИС.Товары КАК АктСписанияЕГАИСТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктСписанияЕГАИС.АкцизныеМарки КАК АктСписанияЕГАИСАкцизныеМарки
	|		ПО АктСписанияЕГАИСТовары.Ссылка = АктСписанияЕГАИСАкцизныеМарки.Ссылка
	|			И АктСписанияЕГАИСТовары.ИдентификаторСтроки = АктСписанияЕГАИСАкцизныеМарки.ИдентификаторСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО АктСписанияЕГАИСТовары.Ссылка = СтатусыДокументовЕГАИС.Документ
	|ГДЕ
	|	АктСписанияЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И АктСписанияЕГАИСТовары.Ссылка.Проведен
	|	И НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусыАктаСписания)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	АктПостановкиНаБалансЕГАИСТовары.Ссылка,
	|	АктПостановкиНаБалансЕГАИСТовары.Ссылка.Дата,
	|	АктПостановкиНаБалансЕГАИСТовары.Ссылка.Номер,
	|	-АктПостановкиНаБалансЕГАИСТовары.Количество
	|ИЗ
	|	Документ.АктПостановкиНаБалансЕГАИС.Товары КАК АктПостановкиНаБалансЕГАИСТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПостановкиНаБалансЕГАИС.АкцизныеМарки КАК АктПостановкиНаБалансЕГАИСАкцизныеМарки
	|		ПО АктПостановкиНаБалансЕГАИСТовары.Ссылка = АктПостановкиНаБалансЕГАИСАкцизныеМарки.Ссылка
	|			И АктПостановкиНаБалансЕГАИСТовары.ИдентификаторСтроки = АктПостановкиНаБалансЕГАИСАкцизныеМарки.ИдентификаторСтроки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО АктПостановкиНаБалансЕГАИСТовары.Ссылка = СтатусыДокументовЕГАИС.Документ
	|ГДЕ
	|	АктПостановкиНаБалансЕГАИСАкцизныеМарки.КодАкцизнойМарки = &КодАкцизнойМарки
	|	И АктПостановкиНаБалансЕГАИСТовары.Ссылка.Проведен
	|	И НЕ СтатусыДокументовЕГАИС.Статус В (&НевыгруженныеСтатусыАктаПостановкиНаБаланс)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ОБЩИЕ";
	
	Возврат Запрос;
	
КонецФункции

#КонецОбласти
